FacingOrientation Property
 Property to get the orientation of family instance facing.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public XYZ FacingOrientation { get; }
  Visual Basic
Public ReadOnly Property FacingOrientation As XYZ
	Get
  Visual C++
public:
property XYZ^ FacingOrientation {
	XYZ^ get ();
}
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →